In [281]:
import pandas as pd
import numpy as np

In [282]:
# !pip install pandas

How is it different from numpy ?
The major limitation of numpy is that it can only work with 1 datatype at a time

Most real-world datasets contain a mixture of different datatypes

Like names of places would be string but their population would be int
==> It is difficult to work with data having heterogeneous values using Numpy

___
McKinsey wants to understand the relation between GDP per capita and life expectancy and 
various trends for their clients.
The company has acquired data from multiple surveys in different countries in the past
This contains info of several years about:
country
population size
life expectancy
GDP per Capita
We have to analyse the data and draw inferences meaningful to the company

In [283]:
df = pd.read_csv(r"G:\My Drive\Training\Students_Access\July_2025_Batch - MIT\3.0 Python\mckinsey.csv")

In [284]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [285]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [286]:
df.dtypes

country        object
year            int64
population      int64
continent      object
life_exp      float64
gdp_cap       float64
dtype: object

In [287]:
df.shape

(1704, 6)

In [288]:
df.size

10224

In [289]:
1704*6

10224

In [290]:
df.head(10)

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106
5  Afghanistan  1977    14880372      Asia    38.438  786.113360
6  Afghanistan  1982    12881816      Asia    39.854  978.011439
7  Afghanistan  1987    13867957      Asia    40.822  852.395945
8  Afghanistan  1992    16317921      Asia    41.674  649.341395
9  Afghanistan  1997    22227415      Asia    41.763  635.341351

In [291]:
df.tail(10)

       country  year  population continent  life_exp     gdp_cap
1694  Zimbabwe  1962     4277736    Africa    52.358  527.272182
1695  Zimbabwe  1967     4995432    Africa    53.995  569.795071
1696  Zimbabwe  1972     5861135    Africa    55.635  799.362176
1697  Zimbabwe  1977     6642107    Africa    57.674  685.587682
1698  Zimbabwe  1982     7636524    Africa    60.363  788.855041
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [292]:
df.describe()

             year    population     life_exp        gdp_cap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [293]:
df.describe(include = "object")

            country continent
count          1704      1704
unique          142         5
top     Afghanistan    Africa
freq             12       624

In [294]:
df1 = pd.DataFrame([
    ["India",1995],
    ["India",1997],
    ["India",1999]
],columns = ["Country","Year"])

In [295]:
df1

  Country  Year
0   India  1995
1   India  1997
2   India  1999

In [296]:
df2 = pd.DataFrame({
    "Country":["India","India","India"],
    "Year":[1995,1997,1999]
})

In [297]:
df2

  Country  Year
0   India  1995
1   India  1997
2   India  1999

In [298]:
df[["country","year"]]

          country  year
0     Afghanistan  1952
1     Afghanistan  1957
2     Afghanistan  1962
3     Afghanistan  1967
4     Afghanistan  1972
...           ...   ...
1699     Zimbabwe  1987
1700     Zimbabwe  1992
1701     Zimbabwe  1997
1702     Zimbabwe  2002
1703     Zimbabwe  2007

[1704 rows x 2 columns]

In [299]:
df.iloc[0:2,0:2]

       country  year
0  Afghanistan  1952
1  Afghanistan  1957

In [300]:
df.loc[[0,2,3],["country","population","continent"]]

       country  population continent
0  Afghanistan     8425333      Asia
2  Afghanistan    10267083      Asia
3  Afghanistan    11537966      Asia

In [301]:
df.iloc[[0,2,3],[0,2,3]]

       country  population continent
0  Afghanistan     8425333      Asia
2  Afghanistan    10267083      Asia
3  Afghanistan    11537966      Asia

In [302]:
df.tail()

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [303]:
df.loc[1703,"population"] = 11215961551

In [304]:
df.tail()

       country  year   population continent  life_exp     gdp_cap
1699  Zimbabwe  1987      9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992     10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997     11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002     11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007  11215961551    Africa    43.487  469.709298

In [305]:
df.loc[[1703]] = ["ZIMBA",2008,154165,np.nan,50,500]

In [306]:
df.tail()

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     ZIMBA  2008      154165       NaN    50.000  500.000000

In [307]:
df["continent"].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania', nan],
      dtype=object)

In [308]:
df["continent"].value_counts()

continent
Africa      623
Asia        396
Europe      360
Americas    300
Oceania      24
Name: count, dtype: int64

In [309]:
df["continent"].nunique()

5

In [310]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [311]:
df.rename({"population":"POP"},axis = 1,inplace = True)

In [312]:
df

          country  year       POP continent  life_exp     gdp_cap
0     Afghanistan  1952   8425333      Asia    28.801  779.445314
1     Afghanistan  1957   9240934      Asia    30.332  820.853030
2     Afghanistan  1962  10267083      Asia    31.997  853.100710
3     Afghanistan  1967  11537966      Asia    34.020  836.197138
4     Afghanistan  1972  13079460      Asia    36.088  739.981106
...           ...   ...       ...       ...       ...         ...
1699     Zimbabwe  1987   9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992  10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997  11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002  11926563    Africa    39.989  672.038623
1703        ZIMBA  2008    154165       NaN    50.000  500.000000

[1704 rows x 6 columns]

In [313]:
df.drop([1703],inplace = True)

In [314]:
df

          country  year       POP continent  life_exp     gdp_cap
0     Afghanistan  1952   8425333      Asia    28.801  779.445314
1     Afghanistan  1957   9240934      Asia    30.332  820.853030
2     Afghanistan  1962  10267083      Asia    31.997  853.100710
3     Afghanistan  1967  11537966      Asia    34.020  836.197138
4     Afghanistan  1972  13079460      Asia    36.088  739.981106
...           ...   ...       ...       ...       ...         ...
1698     Zimbabwe  1982   7636524    Africa    60.363  788.855041
1699     Zimbabwe  1987   9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992  10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997  11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002  11926563    Africa    39.989  672.038623

[1703 rows x 6 columns]

In [315]:
# df.drop(["POP"],axis = 1,inplace = True)

In [316]:
df["POP"] = (df["POP"]/1000000).round(2)

In [317]:
df["add_2_years"] = df["year"] + 2

In [318]:
df

          country  year    POP continent  life_exp     gdp_cap  add_2_years
0     Afghanistan  1952   8.43      Asia    28.801  779.445314         1954
1     Afghanistan  1957   9.24      Asia    30.332  820.853030         1959
2     Afghanistan  1962  10.27      Asia    31.997  853.100710         1964
3     Afghanistan  1967  11.54      Asia    34.020  836.197138         1969
4     Afghanistan  1972  13.08      Asia    36.088  739.981106         1974
...           ...   ...    ...       ...       ...         ...          ...
1698     Zimbabwe  1982   7.64    Africa    60.363  788.855041         1984
1699     Zimbabwe  1987   9.22    Africa    62.351  706.157306         1989
1700     Zimbabwe  1992  10.70    Africa    60.377  693.420786         1994
1701     Zimbabwe  1997  11.40    Africa    46.809  792.449960         1999
1702     Zimbabwe  2002  11.93    Africa    39.989  672.038623         2004

[1703 rows x 7 columns]

In [319]:
df.columns = ['Country', 'Year', 'Population', 'Continent', 'Life_exp', 'Gdp_cap',
       'Add_2_years']

In [320]:
df

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Add_2_years
0,Afghanistan,1952,8.43,Asia,28.801,779.445314,1954
1,Afghanistan,1957,9.24,Asia,30.332,820.853030,1959
2,Afghanistan,1962,10.27,Asia,31.997,853.100710,1964
3,Afghanistan,1967,11.54,Asia,34.020,836.197138,1969
4,Afghanistan,1972,13.08,Asia,36.088,739.981106,1974
...,...,...,...,...,...,...,...
1698,Zimbabwe,1982,7.64,Africa,60.363,788.855041,1984
1699,Zimbabwe,1987,9.22,Africa,62.351,706.157306,1989
1700,Zimbabwe,1992,10.70,Africa,60.377,693.420786,1994
1701,Zimbabwe,1997,11.40,Africa,46.809,792.449960,1999
1702,Zimbabwe,2002,11.93,Africa,39.989,672.038623,2004

In [321]:
df.index = [i for i in range(1001,2704)]

In [322]:
df

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Add_2_years
1001,Afghanistan,1952,8.43,Asia,28.801,779.445314,1954
1002,Afghanistan,1957,9.24,Asia,30.332,820.853030,1959
1003,Afghanistan,1962,10.27,Asia,31.997,853.100710,1964
1004,Afghanistan,1967,11.54,Asia,34.020,836.197138,1969
1005,Afghanistan,1972,13.08,Asia,36.088,739.981106,1974
...,...,...,...,...,...,...,...
2699,Zimbabwe,1982,7.64,Africa,60.363,788.855041,1984
2700,Zimbabwe,1987,9.22,Africa,62.351,706.157306,1989
2701,Zimbabwe,1992,10.70,Africa,60.377,693.420786,1994
2702,Zimbabwe,1997,11.40,Africa,46.809,792.449960,1999
2703,Zimbabwe,2002,11.93,Africa,39.989,672.038623,2004

In [323]:
df.reset_index(inplace = True, drop = True)

In [326]:
df.sort_values(["Year","Country"],ascending = [False,True])

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Add_2_years
11,Afghanistan,2007,31.89,Asia,43.828,974.580338,2009
23,Albania,2007,3.60,Europe,76.423,5937.029526,2009
35,Algeria,2007,33.33,Africa,72.301,6223.367465,2009
47,Angola,2007,12.42,Africa,42.731,4797.231267,2009
59,Argentina,2007,40.30,Americas,75.320,12779.379640,2009
...,...,...,...,...,...,...,...
1644,Vietnam,1952,26.25,Asia,40.412,605.066492,1954
1656,West Bank and Gaza,1952,1.03,Asia,43.160,1515.592329,1954
1668,"Yemen, Rep.",1952,4.96,Asia,32.548,781.717576,1954
1680,Zambia,1952,2.67,Africa,42.038,1147.388831,1954
1692,Zimbabwe,1952,3.08,Africa,48.451,406.884115,1954